app/Controllers/logreg.php

    public function register()
    {
        $provModel = new \App\Models\ProvinsiModel();
        $provinsi = $provModel->findAll();
---
SELECT *
FROM `provinsi`