app/Models/adminuserModel.php

    public function getadminuser($id_user = false)
    {
        if ($id_user == false){
            return $this->findAll();
---
SELECT *
FROM `data_user`